{"license":"GPL","file_hash":null,"name":"SofiLink 2","version":"0.0.6","description":"The package adds preprocessing functions to export properties to Sofistik Teddy (writing DAT Files). The package is especially developed for engineers to control the export and import to structural analysis. A bidirenctional link between parametric models can be created. ","group":"BUW","keywords":["structural","analysis","sofistik","fem","fea","bridge","design"],"dependencies":[],"contents":"Curve.DivideSegments - Divides curve into equal segments using hmin and returns points and station values., Curve.GetParameterValuesAtStations - This Node is based on the definition of a start and end parameter of the structural framing family. It returns the parameter values at the stations from a set of curves and elements., DAT.ReadParametersFromFile - Reads from 'parameters.dat' all defined parameter names and values., DAT.ReadParameterValuesFromFile - Reads from the 'parameter file' the parameter values at each station along the bridge axis 'A1'., DAT.WriteAxisToFile - writes points from spline to SOFiSTiK Axis , DAT.WriteDataToFile - Given a header and a body as a list this node will generate a DAT Sofistik File, DAT.WriteParametersToFile - Given an parameteric element and a set of parameter names it will translate these parameters with values to Sofistik variables., FileSystem.DirectoryInWorkspace - Creates a new folder with a given name in the current workspace (where the .dyn file is located), FileSystem.GetCurrentWorkspace - Retrieves the current worspace directory (where the .dyn file is located) and returns its path as a string., List.IndicesOfItems - returns indices of items' occurence in list , List.RemoveItems - removes given items from list, Parameter.DimensionalInstanceName - Retrieves dimensional instance parameter names from a Revit family in alphabetical order, Point.DivideSegments - Returns nodes from nurbsspline according to suplied segment length, Point.SegmentsToPlacements - returns Placement points from given segments, Point.ToSegments - Seperates list of section positions into segement lists, Revit.ProjectUnits - Set project units to meter.","engine_version":"2.1.0.7733","engine":"dynamo","engine_metadata":"","site_url":"","repository_url":"","contains_binaries":false,"node_libraries":[]}